*lets get to know more about .loc
=> it helps to get a group of values in a row and in a column using labels

In [64]:
import pandas as pd

In [65]:
#lets make a dataframe at first
df = pd.DataFrame([[1,2],[3,4],[5,6]],index= [0,1,2],columns = ['A','B'])
df.loc[0,"A"]
# df.loc['B'] this code wont work because the syntax of the .loc is ["row_name","column_name"] but here teh first thing it sees is column name and it thinks its row name and search on the row list but its not there that means here we have problem and through error
df.loc[:,"B"] #this means give me all rows from column B

0    2
1    4
2    6
Name: B, dtype: int64

In [66]:
#we can also give the instruction using boolean value
df.loc[[True,True,False],[True,False]]

   A
0  1
1  3

In [67]:
df

   A  B
0  1  2
1  3  4
2  5  6

In [68]:
#df.loc[df[0]<5] this wont work because inorder to access row we can only use index df.index["a"] like this if we give df["name"] this means it checks column name and throws error because thats not a column its a row
# df.log[df[df.index['0'].value<3]] basically this condition on values is applied on column name

In [69]:
# we can mention the rows according to condition and also those columns where values are to be checked
df.loc[df['A']>0,"B"]

0    2
1    4
2    6
Name: B, dtype: int64

In [72]:
# we can set teh value of entire column to a particukar constant value
# df.loc[:,df["A"]]=3 this gives us problem because df["A"] RETURNS A value and in value we have to assign value makes no sense do

In [74]:
df

   A  B
0  1  2
1  3  4
2  5  6

In [78]:
df.loc[0:2,"A"] =2

In [80]:
df

   A  B
0  2  2
1  2  4
2  2  6

#lets see what iloc does
* it only works on integer value or boolean value

In [85]:
df.iloc[2,1]

6

In [88]:
df.iloc[:,1]

0    2
1    4
2    6
Name: B, dtype: int64

In [90]:
df

   A  B
0  2  2
1  2  4
2  2  6

In [93]:
df.iloc[[True,False,True],0]

0    2
2    2
Name: A, dtype: int64

In [106]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=[0,1,2],columns=["x","y","z"])
df

   x  y  z
0  1  2  3
1  4  5  6
2  7  8  9

In [108]:
df.iloc[lambda x: x.index % 2 == 0]#get location => get_loc("a")

   x  y  z
0  1  2  3
2  7  8  9

#Map this maps individual value of the given series into another value

In [113]:
s = pd.Series([1.1,2,3,4,5,6,7,8,9])
s.map(lambda x: len(str(x))) #length only works on string

0    3
1    3
2    3
3    3
4    3
5    3
6    3
7    3
8    3
dtype: int64

In [115]:
#lets make a dataframe
df = pd.DataFrame([[1,2],[3,4],[5,6]],index=[0,1,2],columns=["x","y"])
df.iloc[0,0] = pd.NA #making 0,0 na empty
df

     x  y
0  NaN  2
1  3.0  4
2  5.0  6

In [117]:
df.map(lambda x:x+1) #it mapped each value by adding each value by 1

     x  y
0  NaN  3
1  4.0  5
2  6.0  7

In [118]:
df.map(round,ndigits = 1) # here round means rounds off the value and after decimal 1 digit only

     x  y
0  NaN  2
1  3.0  4
2  5.0  6